[
    {
        "id": 1,
        "name": "Software Engineer",
        "location": "Haryana",
        "company": "Salesforce",
        "nature": "Full Time",
        "overview": "Design, build, and test complex software applications..",
        "requirements": "Bachelor's or Master's degree in Computer Science or related field, strong programming skills in Java or other languages, experience with Agile or Scrum methodologies.",
        "work": "Collaborating to understand requirements, writing clean code, testing and debugging software, and improving application performance."
    },
    {
        "id": 2,
        "name": "Data Analyst",
        "location": "Florida",
        "company": "Google",
        "nature": "Full Time",
        "overview": "Analyze large sets of data and provide insights to improve business decisions.",
        "requirements": "Bachelor's or Master's degree in a quantitative field, experience with data analysis.",
        "work": "Analyzing data, creating visualizations, identifying trends and patterns, and presenting findings to stakeholders."
    },
    {
        "id": 3,
        "name": "UX Designer",
        "location": "Maharashtra",
        "company": "Amazon",
        "nature": "Full Time",
        "overview": "Design intuitive and engaging user experiences for digital products.",
        "requirements": "Bachelor's or Master's degree in Design or related field, experience with user-centered design principles, proficiency in design tools like Sketch or Figma.",
        "work": "Conducting user research, creating wireframes and prototypes, collaborating with developers to ensure design implementation, and iterating based on user feedback."
    },
    {
        "id": 4,
        "name": "Cybersecurity Analyst",
        "location": "Washington, D.C",
        "company": "Department of Defense",
        "nature": "Full Time",
        "overview": "Protect organizational assets and data from cyber threats.",
        "requirements": "Bachelor's or Master's degree in Computer Science or related field, experience in cybersecurity, knowledge of security frameworks such as NIST or CIS.",
        "work": "Monitoring and analyzing network traffic, conducting vulnerability assessments and penetration testing, implementing security controls and incident response plans."
    },
    {
        "id": 5,
        "name": "Cloud Solutions Architect",
        "location": "California",
        "company": "Cisco Systems",
        "nature": "Part Time",
        "overview": "Design and implement cloud-based solutions for clients.",
        "requirements": "Bachelor's or Master's degree in Computer Science or related field, experience with cloud platforms such as AWS or Azure, proficiency in programming languages like Python or Java.",
        "work": "Analyzing client needs, designing scalable and resilient architectures, implementing cloud infrastructure and services, and ensuring high availability and security."
    },
    {
        "id": 6,
        "name": "Product Manager",
        "location": "Rajasthan",
        "company": "Google",
        "nature": "Full Time",
        "overview": "Manage the development and launch of digital products.",
        "requirements": "Bachelor's or Master's degree in a relevant field, experience in product management or related roles, knowledge of Agile or Scrum methodologies.",
        "work": "Conducting market research, defining product vision and roadmap, collaborating with designers and engineers, and overseeing product launch and maintenance."
    },
    {
        "id": 7,
        "name": "Machine Learning Engineer",
        "location": "Boston, MA",
        "company": "MIT",
        "nature": "Part Time",
        "overview": "Design and implement machine learning algorithms for various applications.",
        "requirements": "Bachelor's or Master's degree in Computer Science or related field, experience in machine learning, proficiency in programming languages like Python or R, familiarity with deep learning frameworks like TensorFlow or PyTorch.",
        "work": "Gathering and cleaning data, developing and evaluating models, optimizing performance, and integrating models into production systems."
    },
    {
        "id": 8,
        "name": "DevOps Engineer",
        "location": "Uttar Pradesh",
        "company": "Dell Technologies",
        "nature": "Full Time",
        "overview": "Automate the deployment, testing, and monitoring of software applications.",
        "requirements": "Bachelor's or Master's degree in Computer Science or related field, experience with DevOps tools and practices, proficiency in scripting languages like Python or Bash.",
        "work": "Designing and implementing CI/CD pipelines, managing infrastructure as code, setting up monitoring and alerting systems, and troubleshooting production issues."
    },
    {
        "id": 9,
        "name": "Technical Writer",
        "location": "San Diego",
        "company": "Qualcomm",
        "nature": "Full Time",
        "overview": "Create and maintain technical documentation for software products and services.",
        "requirements": "Bachelor's or Master's degree in Technical Writing or related field, experience in technical writing or software development, proficiency in documentation tools like Adobe Framemaker or MadCap Flare.",
        "work": "Collaborating with developers and subject matter experts, creating user manuals and guides, writing release notes and API documentation, and keeping documentation up-to-date."
    },
    {
        "id": 10,
        "name": "Mobile App Developer",
        "location": "New York",
        "company": "Uber",
        "nature": "Part Time",
        "overview": "Design and develop mobile applications for Android or iOS platforms.",
        "requirements": "Bachelor's or Master's degree in Computer Science or related field, experience in mobile app development, proficiency in programming languages like Java or Swift.",
        "work": "Collaborating with designers and product managers, developing and testing code, integrating with APIs and back-end services, and optimizing app performance and user experience."
    }
]